# основы арифметические операций


# основные арифметические операци над числами (int/float)
print("Числа")
val_1 = 1
val_2 = 2

print(val_1, "+", val_2, "=", val_1 + val_2)  # операция сложения двух чисел
print(val_1, "-", val_2, "=", val_1 - val_2)  # операция вычитания двух чисел
print(val_1, "*", val_2, "=", val_1 * val_2)  # операция умножения двух чисел
print(val_1, "/", val_2, "=", val_1 / val_2)  # деление двух чисел
print(val_1, "//", val_2, "=", val_1 // val_2)  # целочисленное деление
print(val_1, "**", val_2, "=", val_1 ** val_2)  # возведение числа val_1 в степень val_2
# etc...

# результат операции можно записывать в другую переменную:
val_3 = val_1 + val_2
print("val_3:", val_3)

# операции можно производить и над литералами:
val_3 = 1 + 2

# операции можно производить над литералами и переменными:
val_3 = val_1 + 2

print(val_1, "<", val_2, "=", val_1 < val_2)
print(val_1, ">", val_2, "=",  val_1 > val_2)
print(val_1, "==", val_2, "=", val_1 == val_2)
print(val_1, ">=", val_2, "=", val_1 >= val_2)
print(val_1, "<=", val_2, "=", val_1 <= val_2)
print(val_1, "!=", val_2, "=", val_1 != val_2)


print()
print()
print()
# операции над строками (string)
print("Строки")

# Для строк также определены некоторые операции, но имеющие несколько
# иной смысл, отдаленно похожый по смыслу на изначальный

val_1 = "left"
val_2 = "right"

print(val_1, "+", val_2, "=", val_1 + val_2)
print('"', val_1, '" *', 8, "=", (" " + val_1 + " ") * 8)

print(val_1, "<", val_2, "=", val_1 < val_2)
print(val_1, ">", val_2, "=",  val_1 > val_2)
print(val_1, "==", val_2, "=", val_1 == val_2)
print(val_1, ">=", val_2, "=", val_1 >= val_2)
print(val_1, "<=", val_2, "=", val_1 <= val_2)
print(val_1, "!=", val_2, "=", val_1 != val_2)
